# 
# Файл с описанием логики работы спамера
# 
# Основная задача спамера - слать сообщения => функция `spamMessage` 
# необходима для отправки сообщения в одном потоке. Это важно, ведь тогда получается, что
# 
# 

import pyautogui
import keyboard
import time


def spamMessage(message:str, count:int, timer:int=5) -> None:
    '''
    Функция печатания спам-сообщения.
    Каждая отдельная итерация будет печатать сообщение с новой строки.
    
    На вход функции подается сообщение `message` типа строк. Это сообщение и будет печататься. 
    Несмотря на декодирование в utf-8 по какой-то причине метод работает только с английскими буквами.
    
    Так же необходимо при выходе функции указать количество сообщений - `count` типа int.
    
    Помимо всего можно указать задержку перед отправкой сообщения - `timer`. По умолчанию стоит 5 секунд, но можно и быстрее.
    Важно, что нельзя поставить время дробным или меньше 1 секунды. В противном случае функция может не работать.
    
    '''
    
    # переводим в формат нормальной записи
    msg = message.encode('utf-8')
    time.sleep(timer)

    while count > 0:
        # экстренная остановка задачи по нажатию кнопки ESC
        if keyboard.is_pressed("esc"):
            return
        else:
            count -= 1
            # ведем запись
            pyautogui.typewrite(msg)
            # печатаем дальше с новой строки (или отправить в случе некоторых мессенджеров)
            pyautogui.press("enter")
    return 